; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_8)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle10 angle20 angle30 angle40 angle50 angle60 angle70 angle80 angle90 angle100 angle110 angle120 angle130 angle140 angle150 angle160 angle170 angle180 angle190 angle200 angle210 angle220 angle230 angle240 angle250 angle260 angle270 angle280 angle290 angle300 angle310 angle320 angle330 angle340 angle350 - angle)
(:init
    (AngleOrd angle0 angle10)
    (AngleOrd angle10 angle20)
    (AngleOrd angle20 angle30)
    (AngleOrd angle30 angle40)
    (AngleOrd angle40 angle50)
    (AngleOrd angle50 angle60)
    (AngleOrd angle60 angle70)
    (AngleOrd angle70 angle80)
    (AngleOrd angle80 angle90)
    (AngleOrd angle90 angle100)
    (AngleOrd angle100 angle110)
    (AngleOrd angle110 angle120)
    (AngleOrd angle120 angle130)
    (AngleOrd angle130 angle140)
    (AngleOrd angle140 angle150)
    (AngleOrd angle150 angle160)
    (AngleOrd angle160 angle170)
    (AngleOrd angle170 angle180)
    (AngleOrd angle180 angle190)
    (AngleOrd angle190 angle200)
    (AngleOrd angle200 angle210)
    (AngleOrd angle210 angle220)
    (AngleOrd angle220 angle230)
    (AngleOrd angle230 angle240)
    (AngleOrd angle240 angle250)
    (AngleOrd angle250 angle260)
    (AngleOrd angle260 angle270)
    (AngleOrd angle270 angle280)
    (AngleOrd angle280 angle290)
    (AngleOrd angle290 angle300)
    (AngleOrd angle300 angle310)
    (AngleOrd angle310 angle320)
    (AngleOrd angle320 angle330)
    (AngleOrd angle330 angle340)
    (AngleOrd angle340 angle350)
    (AngleOrd angle350 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle290 link1)
    (HasAngle angle180 link2)
    (HasAngle angle250 link3)
)
(:goal
(and
    (HasAngle angle330 link1)
    (HasAngle angle250 link2)
    (HasAngle angle270 link3)
    )
)
)

; plan
1. (increase_angle link1 angle290 angle300)
   deleted: (hasangle angle290 link1) (hasangle angle180 link2) (hasangle angle250 link3)
   added: (hasangle angle300 link1) (hasangle angle190 link2) (hasangle angle260 link3)
   goals met: 0 of 3
2. (increase_angle link1 angle300 angle310)
   deleted: (hasangle angle300 link1) (hasangle angle190 link2) (hasangle angle260 link3)
   added: (hasangle angle310 link1) (hasangle angle200 link2) (hasangle angle270 link3)
   goals met: 1 of 3
3. (increase_angle link1 angle310 angle320)
   deleted: (hasangle angle310 link1) (hasangle angle200 link2) (hasangle angle270 link3)
   added: (hasangle angle320 link1) (hasangle angle210 link2) (hasangle angle280 link3)
   goals met: 0 of 3
4. (increase_angle link1 angle320 angle330)
   deleted: (hasangle angle320 link1) (hasangle angle210 link2) (hasangle angle280 link3)
   added: (hasangle angle330 link1) (hasangle angle220 link2) (hasangle angle290 link3)
   goals met: 1 of 3
5. (increase_angle link2 angle220 angle230)
   deleted: (hasangle angle220 link2) (hasangle angle290 link3)
   added: (hasangle angle230 link2) (hasangle angle300 link3)
   goals met: 1 of 3
6. (increase_angle link2 angle230 angle240)
   deleted: (hasangle angle230 link2) (hasangle angle300 link3)
   added: (hasangle angle240 link2) (hasangle angle310 link3)
   goals met: 1 of 3
7. (increase_angle link2 angle240 angle250)
   deleted: (hasangle angle240 link2) (hasangle angle310 link3)
   added: (hasangle angle250 link2) (hasangle angle320 link3)
   goals met: 2 of 3
8. (decrease_angle link3 angle320 angle310)
   deleted: (hasangle angle320 link3)
   added: (hasangle angle310 link3)
   goals met: 2 of 3
9. (decrease_angle link3 angle310 angle300)
   deleted: (hasangle angle310 link3)
   added: (hasangle angle300 link3)
   goals met: 2 of 3
10. (decrease_angle link3 angle300 angle290)
   deleted: (hasangle angle300 link3)
   added: (hasangle angle290 link3)
   goals met: 2 of 3
11. (decrease_angle link3 angle290 angle280)
   deleted: (hasangle angle290 link3)
   added: (hasangle angle280 link3)
   goals met: 2 of 3
12. (decrease_angle link3 angle280 angle270)
   deleted: (hasangle angle280 link3)
   added: (hasangle angle270 link3)
   goals met: 3 of 3
